Revit 2027 API
Connector.ConnectorType Property
The connector type of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorType ConnectorType { get; }
Public ReadOnly Property ConnectorType As ConnectorType
	Get
public:
property ConnectorType ConnectorType {
	ConnectorType get ();
}
member ConnectorType : ConnectorType with get
Property Value
ConnectorType
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace